function [B0, B1, B2, B3, B12, B13, B23, B123] = convert_to_natural_coeffs(b0, b1, b2, b3, b12, b13, b23, b123, X0, n)
    % Входные параметры:
    % b0, b1, b2, b3, b12, b13, b23, b123 - кодированные коэффициенты
    % X0 = [X01, X02, X03] - основные уровни факторов
    % n = [n1, n2, n3] - интервалы варьирования
    
    X01 = X0(1); X02 = X0(2); X03 = X0(3);
    n1 = n(1); n2 = n(2); n3 = n(3);
    
    B0 = b0 - (b1 * X01 / n1 + b2 * X02 / n2 + b3 * X03 / n3) + (b12 * X01 * X02 / (n1 * n2) + b13 * X01 * X03 / (n1 * n3) + b23 * X02 * X03 / (n2 * n3)) - (b123 * X01 * X02 * X03 / (n1 * n2 * n3));
    B1 = (b1 / n1) - (b12 * X02 / (n1 * n2) + b13 * X03 / (n1 * n3)) + (b123 * X02 * X03 / (n1 * n2 * n3));
    B2 = (b2 / n2) - (b12 * X01 / (n1 * n2) + b23 * X03 / (n2 * n3)) + (b123 * X01 * X03 / (n1 * n2 * n3));
    B3 = (b3 / n3) - (b13 * X01 / (n1 * n3) + b23 * X02 / (n2 * n3)) + (b123 * X01 * X02 / (n1 * n2 * n3));
    B12 = (b12 / (n1 * n2)) - (b123 * X03 / (n1 * n2 * n3));
    B13 = (b13 / (n1 * n3)) - (b123 * X02 / (n1 * n2 * n3));
    B23 = (b23 / (n2 * n3)) - (b123 * X01 / (n1 * n2 * n3));
    B123 = b123 / (n1 * n2 * n3);

end