% Кодированные коэффициенты
b0 = 0.187259;
b1 = 0.054032;
b2 = 0.036423;
b3 = 0.010936;
b12 = -0.013518;
b13 = 0.009965;
b23 = -0.004604;
b123 = -0.002741;

% Основные уровни факторов 
X0 = [30, 40, 0.001];

% Интервалы варьирования
n = [20, 25, 0.0005]; 

% Вызов функции
[B0, B1, B2, B3, B12, B13, B23, B123] = convert_to_natural_coeffs(b0, b1, b2, b3, b12, b13, b23, b123, X0, n);

% Вывод результатов
fprintf('B0 = %.6f \n', B0);
fprintf('B1 = %.6f \n', B1);
fprintf('B2 = %.6f \n', B2);
fprintf('B3 = %.6f \n', B3);
fprintf('B12 = %.6f \n', B12);
fprintf('B13 = %.6f \n', B13);
fprintf('B23 = %.6f \n', B23);
fprintf('B123 = %.6f \n', B123);